tap "anomalyco/tap"
tap "atlassian/acli"
tap "dlvhdr/formulae"
tap "gromgit/brewtils"
tap "modem-dev/tap"
tap "nikitabobko/tap"
tap "steipete/tap"
tap "theboredteam/boring-notch", "https://github.com/TheBoredTeam/homebrew-boring-notch"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Multi-shell multi-command argument completer
brew "carapace"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full", link: true
# Banner-like program prints strings as ASCII art
brew "figlet"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# JQ clone focussed on correctness, speed, and simplicity
brew "jaq"
# Command-line pager for JSON data
brew "jless"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Find what models run on your hardware
brew "llmfit"
# Next-gen compiler infrastructure
brew "llvm"
# Hash utilities
brew "md5sha1sum"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Safe, concurrent, practical language
brew "rust"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# General purpose fuzzy finder TUI
brew "television"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted:true
# Android SDK component
cask "android-platform-tools"
# Desktop password and login vault
cask "bitwarden"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch", trusted: true
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Web debugging Proxy application
cask "charles@4"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# Manage SDKs and download device definitions for Garmin Connect IQ development
cask "connectiq-sdk-manager"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Replacement for Docker Desktop
cask "orbstack"
# Visual database editor for Prisma projects
cask "prisma-studio"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
go "github.com/brads3290/cclogviewer/cmd/cclogviewer"
go "github.com/sourcegraph/zoekt/cmd/zoekt-index"
cargo "ast-grep"
cargo "tree-sitter-cli"
npm "corepack"
